#include <stdio.h>
/*
赋值是从右向左赋值

c = b = a + 3
连续赋值 值取决于a + 3

复合赋值
五种用法都可以使用

单目操作符
++ --

+也是单目操作符,但不会对赋值本身产生影响
-不可省略,正负翻转
*/

//int main()
//{
//	int a = 10;//初始化
//	a = 20;//赋值
//	a = 3 + a;
//	printf("%d\n", a);
//	a += 3;//与上文相等 复合赋值
//	return 0;
//}

int main()
{
	int a = 10;
	a = a + 1;
	//a += 1;
	//a++;//单目操作符
	//++a;
	//以上四种写法都是让a的值加1
	//int b = a++;//先使用再加一 a=b a+1
	int c = ++a;//先加一再使用
	//对于本身没有影响,赋值时会有先后调整

	printf("%d\n", a);
	//printf("%d\n", b);
	printf("%d\n", c);

	return 0;
}